docs/corners/david/20210916151841-mirror_exam_prep.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-31 Sun 12:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mirror Exam Prep</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
<link rel="stylesheet" href="/admonition.css" type="text/css"/>

</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Mirror Exam Prep</h1> <h2 class="subtitle"></h2> <span class="author">Taproot</span> <span class="date">2021-10-31 Sun 12:33</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul><li><a class='backlink' href='20210901135039-optima_index.html'>OPTIMA Index</a></li> </ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#org343c59b">1. Pinhole Cameras</a></li>
<li><a href="#org090f35f">2. Mirrors</a>
<ul>
<li><a href="#orgf3cd012">2.1. Plane and Right Angle Mirrors</a></li>
<li><a href="#orgc2425d3">2.2. Spherical &amp; Parabolic Mirrors</a></li>
</ul>
</li>
<li><a href="#org3a2b20a">3. Refraction</a></li>
<li><a href="#orga8d120c">4. Rainbows</a></li>
</ul>
</div></div>
</div>

<div id="outline-container-org343c59b" class="outline-2">
<h2 id="org343c59b"><span class="section-number-2">1</span> Pinhole Cameras</h2>
<div class="outline-text-2" id="text-1">
<p>
You can create an image through allowing light to travel through small hole: light ray from bottom of object will graze the top of the hole, and vice versa. As a result, image is flipped upside down. Increasing the size of the hole increases the the brightness of the image but makes it blurrier. Increasing focal distance (in the case of the pinhole camera this is distance between hole and photosensitive material).
</p>
</div>
</div>

<div id="outline-container-org090f35f" class="outline-2">
<h2 id="org090f35f"><span class="section-number-2">2</span> Mirrors</h2>
<div class="outline-text-2" id="text-2">
<div class="aside" id="orgcbc2ea3">
<ul class="org-ul">
<li><i>Specular</i> reflections obey the Law of Reflection and are flat while <i>diffuse</i> reflections happen on materials that are bumpy and scatter light.</li>
</ul>

</div>

<div class="defn" id="orgce81dd6">
<ul class="org-ul">
<li>The Law of Reflection is that the angle of incidence is angle of reflection.</li>
</ul>

</div>
</div>

<div id="outline-container-orgf3cd012" class="outline-3">
<h3 id="orgf3cd012"><span class="section-number-3">2.1</span> Plane and Right Angle Mirrors</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Plane mirrors intuitively follow the Law of Reflection and project a virtual image behind the mirror.</li>
<li>Similarly, just following the Law of Reflection works fine for mirrors at right angles.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc2425d3" class="outline-3">
<h3 id="orgc2425d3"><span class="section-number-3">2.2</span> Spherical &amp; Parabolic Mirrors</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Parallel rays reflect through the focus</li>
<li>Rays through the focus reflect parallel</li>
<li>Rays through the center (of the <span class="underline">sphere</span>) reflect back through the center.</li>
<li>Rays that reflect off the center of the <span class="underline">surface</span> reflect according to the Law of Reflection</li>
</ul>


<ul class="org-ul">
<li>Mirror equation is \(\frac{1}{f} = \frac{1}{d_o} + \frac{1}{d_i}\) (derive via similar triangles)</li>

<li>\(\frac{d_i}{d_o} = \frac{h_i}{h_o}\) (NOTE: remember to only keep magnitude of \(h_i\)!)</li>

<li>Center of sphere is twice as far as focal length?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3a2b20a" class="outline-2">
<h2 id="org3a2b20a"><span class="section-number-2">3</span> Refraction</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Waves change direction when they encounter a medium that changes their speed.</li>
<li>\(n_1\sin\theta_1 = n_2\sin\theta_2\)</li>
<li>\(n=\frac{c}{v}\) where v is speed of light in medium (and c = 299792458 m/s)</li>
<li>Critical angle is the angle of total internal reflection: aka when refraction angle is \(90^\circ\)</li>
<li>Remember that angles are relative to the <i>normals</i>!</li>
</ul>
</div>
</div>

<div id="outline-container-orga8d120c" class="outline-2">
<h2 id="orga8d120c"><span class="section-number-2">4</span> Rainbows</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Mediums can be <i>dispersive</i>, meaning that the velocity of light traveling through the medium varies with wavelength.</li>
<li>Shorter wavelengths like violet have higher indices of refraction in a medium whilst longer wavelengths like red have smaller indices of refraction.</li>
<li>This means that in a rainbow, colors like red will be at the top and blue at the bottom.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
